---
kind: property
id: P:Autodesk.Revit.DB.TableView.MaximumGridWidth
source: html/d0ff31aa-a0ac-2365-1ece-20ac6683a49d.htm
---
# Autodesk.Revit.DB.TableView.MaximumGridWidth Property

Gets the allowed maximum grid width

## Syntax (C#)
```csharp
public int MaximumGridWidth { get; }
```